# IsSATImportLinkAvailable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OptionalFunctionalityUtils..::..IsSATImportLinkAvailable Method
OptionalFunctionalityUtils Class See Also
---
Checks whether the SAT Import/Link functionality is available in the installed Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool IsSATImportLinkAvailable()
```

Visual Basic
---
```text
Public Shared Function IsSATImportLinkAvailable As Boolean
```

Visual C++
---
```text
public:
static bool IsSATImportLinkAvailable()
```

# ### Return Value
True if the SAT Import/Link functionality is available in the installed Revit.
# Remarks
SAT Import/Link is optional functionality that does not have to be part of the Revit installation.
# See Also
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace